#+STARTUP: fold

** Python
   In order to have ipython correctly formatted, I need to use this arguments.
   #+begin_src emacs-lisp
     (setq python-shell-interpreter "ipython3"
	   python-shell-interpreter-args "-i --simple-prompt --InteractiveShell.display_page=True")
   #+end_src

   #+RESULTS:
   : -i --simple-prompt --InteractiveShell.display_page=True

   #+begin_src emacs-lisp
     ;(use-package lsp-jedi
     ;  :ensure t
     ;  :config
     ;  (with-eval-after-load "lsp-mode"
     ;    (add-to-list 'lsp-disabled-clients 'pyls)
     ;    (add-to-list 'lsp-enabled-clients 'jedi)))

     ;;(use-package lsp-python-ms
     ;;  :ensure t
     ;;  :init (setq lsp-python-ms-auto-install-server t)
     ;;  :hook (python-mode . (lambda ()
     ;;			  (require 'lsp-python-ms)
     ;;			  (lsp))))  ; or lsp-deferred
     ;;y
   #+end_src

   #+RESULTS:
   : t

   #+begin_src emacs-lisp
     (setenv "WORKON_HOME" "/home/grass/py_home")
   #+end_src
